MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FX512VMD12/mcu.h
#define OPCODE                        0x7FFF80000000      // Opcode Field In PAUSE Frames
#define PAUSE_DUR                     0x7FFF8000      // Pause Duration


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IAUR register.
//
//*****************************************************************************

#define IADDR1                        0x7FFFFFFF80000000      // Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IALR register.
//
//*****************************************************************************

#define IADDR2                        0x7FFFFFFF80000000      // Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_GAUR register.
//
//*****************************************************************************

#define GADDR1                        0x7FFFFFFF80000000      // Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_GALR register.
//
//*****************************************************************************

#define GADDR2                        0x7FFFFFFF80000000      // Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TFWR register.
//
//*****************************************************************************

#define STRFWD                        0x00000100      // Store And Forward Enable
#define Reserved                      0x00000180      // This field is reserved.
#define TFWR                          0x000007E0      // Transmit FIFO Write


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RDSR register.
//
//*****************************************************************************

#define R_DES_START                   0xFFFFFFF80000000      // Pointer to the beginning of the receive buffer descriptor queue.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TDSR register.
//
//*****************************************************************************

#define X_DES_START                   0xFFFFFFF80000000      // Pointer to the beginning of the transmit buffer descriptor queue.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MRBR register.
//
//*****************************************************************************

#define Reserved                      0xFFFFF80000000      // This field is reserved.
#define R_BUF_SIZE                    0x0001FC00      // Receive buffer size in bytes.
#define Reserved                      0x00000078      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RSFL register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define RX_SECTION_FULL               0x00007F80      // Value Of Receive FIFO Section Full Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RSEM register.
//
//*****************************************************************************

#define Reserved                      0x3FF80000000      // This field is reserved.
#define Reserved                      0x01F00000      // This field is reserved.
#define Reserved                      0x007F8000      // This field is reserved.
#define RX_SECTION_EMPTY              0x00007F80      // Value Of The Receive FIFO Section Empty Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RAEM register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define RX_ALMOST_EMPTY               0x00007F80      // Value Of The Receive FIFO Almost Empty Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RAFL register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define RX_ALMOST_FULL                0x00007F80      // Value Of The Receive FIFO Almost Full Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TSEM register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define TX_SECTION_EMPTY              0x00007F80      // Value Of The Transmit FIFO Section Empty Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TAEM register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define TX_ALMOST_EMPTY               0x00007F80      // Value of Transmit FIFO Almost Empty Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TAFL register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define TX_ALMOST_FULL                0x00007F80      // Value Of The Transmit FIFO Almost Full Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TIPG register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFFF80000000      // This field is reserved.
#define IPG                           0x000001F0      // Transmit Inter-Packet Gap


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_FTRL register.
//
//*****************************************************************************

